tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "stow"
brew "go"
brew "kubectl"
brew "tmux"
brew "nvm"
brew "neovim"
brew "the_silver_searcher"
brew "ripgrep"
brew "python"
brew "kubecolor"
brew "asdf"
brew "gawk"
brew "gettext"
brew "awscli"
brew "pre-commit"
brew "jq"
brew "coreutils"
brew "gh"
brew "tig"
brew "k9s"
brew "postgresql"
brew "pgcli"
brew "keyring"
brew "ykman"

cask "visual-studio-code"
cask "docker"
cask "kitty"
cask "google-chrome"
cask "postman"
cask "aws-vault"
