tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Shell
brew "starship" # PS1 management tool
brew "fish"
brew "tmux"
brew "bash"
cask "wezterm"

# General
brew "kubecolor"
brew "coreutils"
brew "stow"
brew "gettext"
brew "gawk"
cask "google-chrome"

# Languages
brew "python" # try to use mise instead

# Security
brew "keyring"
brew "ykman"

# Code editors
brew "neovim"
cask "visual-studio-code"

# Data manipulation
brew "jq"
brew "yq"
brew "fx"

# Git
brew "gh"
brew "tig"
brew "lindell/multi-gitter/multi-gitter"

# Database
brew "postgresql"
brew "pgcli"

# Devops
brew "mise"
brew "awscli"
brew "semgrep"
brew "trivy"
brew "tflint"
brew "kubectx"
brew "k9s"
brew "htop"
brew "pre-commit"
cask "docker"
cask "postman"
cask "aws-vault"

# Search tools
brew "pandoc" # Dependency of rga
brew "poppler" # Dependency of rga
brew "ffmpeg" # Dependency of rga
brew "rga" # Allow stextual search and document search
brew "the_silver_searcher"
brew "ripgrep"
