tap "homebrew/bundle"

# Shell & Utils
brew "bash" # Updated bash (MacOS uses an older one)
brew "fish" # Alternative shell with better built-in stuff
brew "tinty" # Shell colours
brew "htop"
brew "mise" # python, node, opentofu, golang
brew "lima-additional-guestagents"
brew "stow" # Required to symlink configs
brew "gettext" # GNU internationalization (i18n) and localization (l10n) library
brew "gawk" # GNU awk utility
brew "tig"
brew "httpie" # Better curl
brew "postgresql" # Normal Postgres CLI
brew "pgcli" # Better Postgres CLI

cask "ghostty"
cask "wezterm"
cask "google-chrome"
cask "google-cloud-sdk"
cask "visual-studio-code"
