tap "homebrew/bundle"

# Shell & Utils
brew "starship" # PS1 management tool
brew "bash" # Updated bash (MacOS uses an older one)
brew "fish" # Alternative shell with better built-in stuff
brew "tmux" # Terminal multiplexer (although, some terminals are good enough)
brew "lsd" # Better ls
brew "bat" # Better less/cat
brew "fzf" # Better find
brew "htop"

# General development
brew "direnv"
brew "mise" # python, node, opentofu, golang
brew "semgrep"
brew "trivy"
brew "tflint"
brew "pre-commit"
brew "golangci-lint"
brew "gemini-cli"

# Cloud vendors
brew "awscli"
brew "doctl"
brew "fly"

# Docker & Kubernetes
brew "argocd"
brew "cilium-cli"
brew "colima" # Docker runtime
brew "docker-compose"
brew "helm"
brew "k9s"
brew "kubectx"
brew "kustomize"
brew "lima-additional-guestagents"
brew "minikube"

# Scripting
brew "just" # Modern Make
brew "gum" # Helpers to use in shell scripts

# GNU
brew "coreutils" # GNU File, Shell, and Text utilities
brew "stow" # Required to symlink configs
brew "gettext" # GNU internationalization (i18n) and localization (l10n) library
brew "gawk" # GNU awk utility

# Code editors
brew "neovim"

# Data manipulation
brew "jq" # JSON manipulation
brew "yq" # YAML manipulation
brew "fx" # JSON viewer
brew "nushell" # Data driven shell

# Git
brew "gh"
brew "tig"
brew "delta" # Better diffing
brew "git-extras" # Many extra aliases for git

# HTTP
brew "hurl" # Terminal alternative to Postman
brew "httpie" # Better curl

# Database
brew "postgresql" # Normal Postgres CLI
brew "pgcli" # Better Postgres CLI

# Search
brew "pandoc" # Dependency of rga
brew "poppler" # Dependency of rga
brew "ffmpeg" # Dependency of rga
brew "rga" # Allows textual search and document search
brew "the_silver_searcher"
brew "ripgrep"

# Casks (they are more annoying to install)
cask "ghostty"
cask "wezterm"
cask "google-chrome"
cask "google-cloud-sdk"
cask "visual-studio-code"
